package lesson4;

import java.util.Scanner;

public class Main {
	public static void main(String[] args) {
//		int a = 5;
//		int b = 3;
//		int sum = a + b;
//		System.out.println(sum);
//		int difference = a - b;
//		System.out.println(difference);
//		int product = a * b;
//		System.out.println(product);
//
//		System.out.println(a / b);

//		double a = 5;
//		double b = 2;
//		System.out.println(a / b);

//		int a=8;
//		int b=3;
//		System.out.println(a/b);
//		System.out.println(b/a);
//		System.out.println(a % b);

//		int number1 = 5;
//		
//		
//		number1 = number1 + 5;
//		number1 += 5;
//		
//		number1-=2; //number1=number1-2
//		number1*=3; //number1=number1*3
//		number1/=8; // number1=number1/8
//		
//		System.out.println(number1);

//		int number=6;
//		number++;
//		
//		System.out.println(number);
//		number--;
//		System.out.println(number);
//
//		int a = 20;
//		int b = 20;
//		System.out.println(a>b);
//		System.out.println(a<b);
//		System.out.println(a>=b);
//		System.out.println(a<=b);
//		System.out.println(a==b);
//		System.out.println(a!=b);

		
		
		
		
//Напишите программу, которая вычисляет остаток от деления двух чисел, введённых пользователем.	

//		Scanner scanner = new Scanner(System.in);
//		System.out.println("введи два числа");
//		int number1 = scanner.nextInt();
//		int number2 = scanner.nextInt();
//
//		System.out.println(number1 % number2);

//Реализуйте программу, которая увеличивает введённое пользователем число на 10 с помощью оператора присваивания (+=).

//		Scanner scanner = new Scanner(System.in);
//		System.out.println("введите одно число");
//		int number=scanner.nextInt();
//		number+=10;  //number=number+10
//		System.out.println(number);

//	Напишите программу, которая умножает введённое число на 5 с использованием оператора присваивания (*=).

//Создайте программу, которая выводит сумму квадратов двух чисел, введённых пользователем.	
//		Scanner scanner = new Scanner(System.in);
//		System.out.println("введи два числа");
//		int number1 = scanner.nextInt();
//		int number2 = scanner.nextInt();
//
//		System.out.println(number1 % number2);

//Создайте программу, которая выводит сумму квадратов двух чисел, введённых пользователем.			

//		Scanner scanner = new Scanner(System.in);
//		int number1 = scanner.nextInt();
//		int number2 = scanner.nextInt();
//
//		number1 *= number1;
//		number2 *= number2;
//		System.out.println(number1 + number2);

//		int x = 3;
//		x = 5;
//		System.out.println(x);

	}
}
